; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-14-12)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 - object)
(:init
(at-robby robot1 room6)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room5)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room1)
(at ball2 room9)
(at ball3 room11)
(at ball4 room2)
(at ball5 room9)
(at ball6 room8)
(at ball7 room11)
(at ball8 room10)
(at ball9 room9)
(at ball10 room8)
(at ball11 room3)
(at ball12 room13)
)
(:goal
(and
(at ball1 room13)
(at ball2 room11)
(at ball3 room10)
(at ball4 room11)
(at ball5 room8)
(at ball6 room10)
(at ball7 room11)
(at ball8 room5)
(at ball9 room4)
(at ball10 room11)
(at ball11 room10)
(at ball12 room3)
)
)
)

; plan
1. (move robot1 room6 room9)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room9)
   goals met: 1 of 12
2. (move robot2 room5 room9)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room9)
   goals met: 1 of 12
3. (pick robot1 ball9 room9 lgripper1)
   deleted: (at ball9 room9) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 1 of 12
4. (pick robot2 ball5 room9 lgripper2)
   deleted: (at ball5 room9) (free robot2 lgripper2)
   added: (carry robot2 ball5 lgripper2)
   goals met: 1 of 12
5. (pick robot2 ball2 room9 rgripper2)
   deleted: (at ball2 room9) (free robot2 rgripper2)
   added: (carry robot2 ball2 rgripper2)
   goals met: 1 of 12
6. (move robot1 room9 room4)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room4)
   goals met: 1 of 12
7. (move robot2 room9 room3)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room3)
   goals met: 1 of 12
8. (drop robot1 ball9 room4 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room4) (free robot1 lgripper1)
   goals met: 2 of 12
9. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 2 of 12
10. (move robot1 room4 room10)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room10)
   goals met: 2 of 12
11. (move robot2 room2 room8)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room8)
   goals met: 2 of 12
12. (pick robot1 ball8 room10 lgripper1)
   deleted: (at ball8 room10) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 2 of 12
13. (drop robot2 ball5 room8 lgripper2)
   deleted: (carry robot2 ball5 lgripper2)
   added: (at ball5 room8) (free robot2 lgripper2)
   goals met: 3 of 12
14. (move robot1 room10 room5)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room5)
   goals met: 3 of 12
15. (move robot2 room8 room11)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room11)
   goals met: 3 of 12
16. (drop robot1 ball8 room5 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room5) (free robot1 lgripper1)
   goals met: 4 of 12
17. (drop robot2 ball2 room11 rgripper2)
   deleted: (carry robot2 ball2 rgripper2)
   added: (at ball2 room11) (free robot2 rgripper2)
   goals met: 5 of 12
18. (pick robot2 ball3 room11 lgripper2)
   deleted: (at ball3 room11) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 5 of 12
19. (move robot2 room11 room13)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room13)
   goals met: 5 of 12
20. (move robot1 room5 room2)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room2)
   goals met: 5 of 12
21. (pick robot1 ball4 room2 lgripper1)
   deleted: (at ball4 room2) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 5 of 12
22. (pick robot2 ball12 room13 rgripper2)
   deleted: (at ball12 room13) (free robot2 rgripper2)
   added: (carry robot2 ball12 rgripper2)
   goals met: 5 of 12
23. (move robot1 room2 room11)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room11)
   goals met: 5 of 12
24. (move robot2 room13 room10)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room10)
   goals met: 5 of 12
25. (drop robot1 ball4 room11 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room11) (free robot1 lgripper1)
   goals met: 6 of 12
26. (drop robot2 ball3 room10 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room10) (free robot2 lgripper2)
   goals met: 7 of 12
27. (move robot2 room10 room3)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room3)
   goals met: 7 of 12
28. (move robot1 room11 room8)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room8)
   goals met: 7 of 12
29. (drop robot2 ball12 room3 rgripper2)
   deleted: (carry robot2 ball12 rgripper2)
   added: (at ball12 room3) (free robot2 rgripper2)
   goals met: 8 of 12
30. (pick robot2 ball11 room3 lgripper2)
   deleted: (at ball11 room3) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 8 of 12
31. (pick robot1 ball6 room8 lgripper1)
   deleted: (at ball6 room8) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 8 of 12
32. (pick robot1 ball10 room8 rgripper1)
   deleted: (at ball10 room8) (free robot1 rgripper1)
   added: (carry robot1 ball10 rgripper1)
   goals met: 8 of 12
33. (move robot1 room8 room11)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room11)
   goals met: 8 of 12
34. (move robot2 room3 room10)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room10)
   goals met: 8 of 12
35. (drop robot1 ball10 room11 rgripper1)
   deleted: (carry robot1 ball10 rgripper1)
   added: (at ball10 room11) (free robot1 rgripper1)
   goals met: 9 of 12
36. (drop robot2 ball11 room10 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room10) (free robot2 lgripper2)
   goals met: 10 of 12
37. (move robot1 room11 room10)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room10)
   goals met: 10 of 12
38. (move robot2 room10 room1)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room1)
   goals met: 10 of 12
39. (drop robot1 ball6 room10 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room10) (free robot1 lgripper1)
   goals met: 11 of 12
40. (pick robot2 ball1 room1 lgripper2)
   deleted: (at ball1 room1) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 11 of 12
41. (move robot2 room1 room13)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room13)
   goals met: 11 of 12
42. (drop robot2 ball1 room13 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room13) (free robot2 lgripper2)
   goals met: 12 of 12
